pages/sudoku-solver/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="a-WASM-e solving of sudoku boards in rust and web assembly.">
<meta name="viewport" content="width=device-width">
<title>Sudoku Solver | im_oisin</title>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://imois.in/pages/sudoku-solver/">
<!--[if lt IE 9]><![endif]--><link href="https://code.jquery.com/ui/1.10.2/themes/smoothness/jquery-ui.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/cookies-eu-banner.default.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/sudoku.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="author" content="Oisin Carroll">
<meta property="og:site_name" content="im_oisin">
<meta property="og:title" content="Sudoku Solver">
<meta property="og:url" content="https://imois.in/pages/sudoku-solver/">
<meta property="og:description" content="a-WASM-e solving of sudoku boards in rust and web assembly.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-06-16T23:04:35+01:00">
</head>
<body>

    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://imois.in/" title="im_oisin" rel="home">
                im_oisin
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
                <li><a href="../about-me">About Me</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Sudoku Solver
            </div>
        </div>
    </div>

    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-orgda8f209" class="outline-2">
<h2 id="orgda8f209">(Killer) Sudoku Solver</h2>
<div class="outline-text-2" id="text-orgda8f209">
<p>
A solver for killer and/or regular sudokus! It's written in rust and compiled to web assembly. It supports fixed digits and constraints on the sum of different cells.
</p>

<p>
Enter digits into the grid, or add some sum-rules. For more detailed instructions see below.
</p>

<div class="sudoku_container">
    <!--<div>
        <h2>(Killer) Sudoku Solver</h2>
        <div>
        <p>
        A solver for killer and/or regular sudokus! It's written in rust and compiled to web assembly. It supports fixed digits and constraints on the sum of different cells.
        </p>
        <p>
        Enter digits into the grid, or add some sum-rules. For more detailed instructions see below.
        </p>
        </div>
    </div>-->
    <div>
        <button id="solve_button" type="button">Solve!</button>
        <button id="reset_button" type="button">Reset</button>
    </div>
    <table id="sudokutr" class="sudoku_grid"></table>
<div class="sumrule_container">
        <table id="sudokurules" class="sumrule_table"><tr>
<th>Cell ixs</th>
<th>Sum To</th> <th></th>
</tr></table>
<div> <button id="add_rule_button" type="button">+</button> </div>
    </div>
</div>
<script type="module" src="../../assets/js/sudoku/sudoku_board.js"></script>
</div>

<div id="outline-container-orgc9931b7" class="outline-3">
<h3 id="orgc9931b7">Fixed digits</h3>
<div class="outline-text-3" id="text-orgc9931b7">
<ul class="org-ul">
<li>You can enter fixed digits by selecting the cell and entering a digit. You can enter more than one by click+draging or shift+clicking, and enter multiple digits at once.</li>
</ul>
</div>
</div>
<div id="outline-container-org18449ff" class="outline-3">
<h3 id="org18449ff">Sum constraints</h3>
<div class="outline-text-3" id="text-org18449ff">
<ul class="org-ul">
<li>Each cell has a corresponding index from \(0-81\). Constraints consist of any number of these indices and a sum they should make.</li>
<li>To create a new constraint: select the desired cells and click the '+' button at the bottom. This will create a new row. You can then modify the sum value itself by clicking on it.</li>
<li>Constraints can be edited by clicking on the corresponding `Cell ixs` entry, and reselecting squares.</li>
<li>Unlike some other solvers, constraints can overlap arbitrarily.</li>
</ul>
</div>
</div>

<div id="outline-container-org5e511ec" class="outline-3">
<h3 id="org5e511ec">Solving</h3>
<div class="outline-text-3" id="text-org5e511ec">
<p>
Finally, when you have a board complete… Hit solve. The first solution found will be displayed, or a warning if no solution could be found (is possible).
</p>
</div>
</div>

<div id="outline-container-org2c68eb4" class="outline-3">
<h3 id="org2c68eb4">The solver itself</h3>
<div class="outline-text-3" id="text-org2c68eb4">
<p>
The solver's been a learning exercise for rust and as such - the code isn't excellent. There are some neat tricks in it though!
</p>

<p>
It uses bitsets to improve performance, where possibilities for each cell are stored as a single binary number. If [1,3,5] were candidates for a square this is stored as \(000010101\) - where the least significant digit corresponding to 1 being a candidate etc. When a number is placed in a square it can be removed as a candidate from row/column/box efficiently using binary digits.
</p>

<p>
Sums constraints are calculated and cached in a hashset. If a constraint required us to make 8 in 3 squares there are only two ways to do it: [1,2,5] and [1,3,4]… And is similarly stored as a mask: \(000011111\) - corresponding to all numbers that could make up a solution. This can be used to quickly mask squares. The calculation of these constraints is done quickly and lazily with some dynamic programming tricks - i.e. <a href="https://www.geeksforgeeks.org/0-1-knapsack-problem-dp-10/">knapsack</a>.
</p>

<p>
When a digit is placed in a cell two things happen - its value is removed as a candidate from row/column/box, then sum constraints containing the cell are updated and the resulting new mask is reapplied to the remaining squares.
</p>

<p>
If those rules are enough to solve the puzzle - it's extremely fast. It can solve up to 2 million sudokus per second! Otherwise, it must guess a square and backtrack if it reaches a contradiction. It tries to guess the square with the fewest candidates.
</p>

<p>
It's lack of more complex solving techniques; hidden singles, naked pairs etc. means it struggles to compare with the <a href="https://github.com/t-dillon/tdoku">fastest solvers of the day</a>. For comparison it solves ~900/second of the 'puzzles5<sub>forum</sub><sub>hardest</sub>' puzzles in the previous link (best=24,001/sec), while averaging a whopping 1456 guesses/puzzle (best=64 guesses). Not too bad for a weekend though… And it may in fact be the fastest killer sudoku solver!
</p>
</div>
</div>
</div>
        
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"] ],
        displayMath: [ ['$$','$$'], ["\\[","\\]"] ],
        processEscapes: true
    },
    "HTML-CSS": {
        styles: {'.MathJax_Display': {"margin": 0}}
    }
});
</script>
</div>
    </div>

    
    <footer><div class="container">
            <div class="social">
                <div class="social-entry">
                    <a href="mailto:oisincar@gmail.com" target="_blank">
                        <i class="fa fa-envelope-o"></i>
                    </a>
                </div>


                <div class="social-entry">
                    <a href="https://github.com/oisincar" target="_blank">
                        <i class="fa fa-github"></i>
                    </a>
                </div>

                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2021         <a href="mailto:oisincar@gmail.com">Oisin Carroll</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><div id="cookies-eu-banner" style="display: none; position:fixed; bottom: 0;">
        By continuing to visit this site, you accept the use of cookies by Google Analytics and Google Adsense.
        <a href="https://imois.in/pages/privacy-policy/" id="cookies-eu-more">Read more</a>
        <button id="cookies-eu-reject">Reject</button>
        <button id="cookies-eu-accept">Accept</button>
    </div>

    
<script src="../../assets/js/cookies-eu-banner.js"></script><script>
    new CookiesEuBanner(function () {
        // Your code to launch when user accept cookies
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

        ga('create', 'UA-143421297-1', 'auto');
        ga('send', 'pageview');


        // TODO: Set up adsense here..??
    }, true);

</script><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script><div>
</div>
</body>
</html>
